import React, { Component } from 'react'
import Layout from '../Components/Layout'
import $ from 'jquery'

export default class FAQ extends Component {

   HandleAnswer=(which)=> {
      $(which).slideToggle();
  }

  render() {
    return (
      <Layout>
          <div className="faq">
              <div className="aboutu_title text-light text-center fw-bold pt-2 fs-4">سوالات متداول</div>
              <div className="texts mt-3 fs-5">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها
               و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی
               می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان
               رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و 
              شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.

              </div>
              <ul className='questions mt-5'>
                <li onClick={()=>this.HandleAnswer(".answer_one")} className="question text-light pt-2 fs-3 mt-3">ایا امکان بازگردانی کالا وجود دارد؟
                  <ul className="answer p-0 nav fs-5 answer_one"><li>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است . چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.</li></ul>
                </li>
                <li onClick={()=>this.HandleAnswer(".answer_two")} className="question text-light pt-2 fs-3 mt-3">ایا امکان همکاری با شرکت شما وجود دارد؟
                  <ul className="answer p-0 nav fs-5 answer_two"><li>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است . چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.</li></ul>
                </li>
                <li onClick={()=>this.HandleAnswer(".answer_three")} className="question text-light pt-2 fs-3 mt-3">ایا امکان تعویض کالا وجود دارد؟
                 <ul className="answer p-0 nav fs-5 answer_three"><li>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است . چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.</li></ul>
                </li>
                <li onClick={()=>this.HandleAnswer(".answer_four")} className="question text-light pt-2 fs-3 mt-3">چه زمانی تخفیف بر روی کالاها صورت میگیرد؟
                 <ul className="answer p-0 nav fs-5 answer_four"><li>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است . چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.</li></ul>
                </li>
              </ul>
          </div>
      </Layout>
    )
  }
}
